package task3;

/*
    Задание 3.
    Необходимо преобразовать список городов в массив и путем перебора массива найти индекс
    элемента и значение с наибольшим количеством жителей города.

    Пример полученного результата:
    [489] = 11 514 330
*/

public class Main {
    public static void main(String[] args) {
        System.out.println(CityUtils.getMaxPopulationIndex());
    }

}
